# coding=utf-8

'''
En aquest fitxer es desen les diferents matrius, llistes de fonemes i noms de fitxers necessaris per tal d'executar el
programa amb l'objectiu de simplificar el codi del fitxer main.py
'''

#                           Bilab         LabioD         Dental          Alveo           PostAlv         Palat           Velar           Uvular          LabioPalat
conson_fonemes_mat =   [[ ('','m'),     ('','ɱ'),       ('',''),        ('','n'),       ('',''),        ('','ɲ'),       ('','ŋ'),       ('',''),        ('','')],    #Nasal
                        [ ('p','b'),    ('',''),        ('',''),        ('t','d'),      ('',''),        ('c',''),       ('k','g'),      ('',''),        ('','')],    #Plosive
                        [ ('',''),      ('',''),        ('',''),        ('',''),        ('ʧ','ʤ'),      ('',''),        ('',''),        ('',''),        ('','')],    #Africada
                        [ ('','β'),     ('f','v'),      ('θ','ð'),      ('s','z'),      ('ʃ','ʒ'),      ('ç','ʝ'),      ('x','ɣ'),      ('χ','ʁ'),      ('','')],    #fricativa
                        [ ('',''),      ('','ʋ'),       ('',''),        ('',''),        ('',''),        ('','j'),       ('',''),        ('',''),        ('','ɥ')],   #Aproximant
                        [ ('',''),      ('',''),        ('',''),        ('','ɾ'),       ('',''),        ('',''),        ('',''),        ('',''),        ('','')],    #Tap
                        [ ('',''),      ('',''),        ('',''),        ('','r'),       ('',''),        ('',''),        ('',''),        ('',''),        ('','')],    #Trill
                        [ ('',''),      ('',''),        ('',''),        ('','l'),       ('',''),        ('','ʎ'),       ('',''),        ('',''),        ('','')]]    #Aproximant lateral

#                           Bilab         LabioD         Dental          Alveo           PostAlv         Palat           Velar           Uvular          LabioPalat
conson_transcr_mat =   [[ ('','m'),     ('','M'),       ('',''),        ('','n'),       ('',''),        ('','J'),       ('','N'),       ('',''),        ('','')],    #Nasal
                        [ ('p','b'),    ('',''),        ('',''),        ('t','d'),      ('',''),        ('c',''),       ('k','g'),      ('',''),        ('','')],    #Plosive
                        [ ('',''),      ('',''),        ('',''),        ('',''),        ('4','5'),      ('',''),        ('',''),        ('',''),        ('','')],    #Africada
                        [ ('','B'),     ('f','v'),      ('T','D'),      ('s','z'),      ('S','Z'),      ('C','ʝ'),      ('x','G'),      ('X','K'),      ('','')],    #fricativa
                        [ ('',''),      ('','8'),       ('',''),        ('',''),        ('',''),        ('','j'),       ('',''),        ('',''),        ('','H')],   #Aproximant
                        [ ('',''),      ('',''),        ('',''),        ('','R'),       ('',''),        ('',''),        ('',''),        ('',''),        ('','')],    #Tap
                        [ ('',''),      ('',''),        ('',''),        ('','r'),       ('',''),        ('',''),        ('',''),        ('',''),        ('','')],    #Trill
                        [ ('',''),      ('',''),        ('',''),        ('','l'),       ('',''),        ('','L'),       ('',''),        ('',''),        ('','')]]    #Aproximant lateral

## En una mateixa columna, a la dreta vol dir sonor i a l'esquerra vol dir sord


vocals_fonemes_mat =   [[("i","y"),     ("ɨ",""),       ("","w")],
                        [("ɪ","Y"),     ("",""),        ("","ʊ")],
                        [("e","ø"),     ("",""),        ("","o")],
                        [("",""),       ("ə",""),       ("","")],
                        [("ɛ","œ"),     ("ɜ",""),       ("ʌ","ɔ")],
                        [("æ",""),      ("ɐ",""),       ("","")],
                        [("a",""),      ("",""),        ("ɑ","ɒ")]]

vocals_transcr_mat =   [[("i","y"),     ("1",""),       ("","u")],
                        [("I","Y"),     ("",""),        ("","U")],
                        [("e","2"),     ("",""),        ("","o")],
                        [("",""),       ("@",""),       ("","")],
                        [("E","9"),     ("3",""),       ("V","O")],
                        [("F",""),      ("ɐ",""),       ("","")],
                        [("a",""),      ("",""),        ("A","Q")]]

consonants = ['m','ɱ','n','ɲ','p','b','t','d','c','k','g','ʧ','ʤ','s','z','ʃ','ʒ','β','f','v','θ','ð','ç','ʝ','x','ɣ','χ','ʁ','ʋ','j','ɥ','ɾ','r','l','ʎ']
consonants_transcr = ['m','M','n','n','p','b','t','d','c','k','g','4','5','s','z','S','Z','B','f','v','T','D','C','ʝ','x','G','X','K','8','j','H','R','r','l','L']

vocals =            ['a','ə','æ','ɑ','ɜ','ɐ','e','ɛ','œ','i','ɪ','y','ʏ','ɨ','o','ɔ','ʌ','ɒ','ø','u','w','ʊ']
vocals_transcr =    ['a','@','F','A','3','6','e','E','9','i','I','y','Y','1','o','O','V','Q','2','u','w','U']


llista_idiomes = ['catala.txt','castella.txt','frances.txt', 'italia.txt', 'portugues.txt','holandes.txt', 'angles.txt', 'alemany.txt']
llista_idiomes_fonetic = ['catala-F.txt','castella-F.txt','frances-F.txt', 'italia-F.txt', 'portugues-brazil-F.txt','portugues-portugal-F.txt','holandes-F.txt', 'angles-F.txt', 'alemany-F.txt']

matriu_resultant_lexic = [[0,0,0,0,0,0,0,0],
                    [0,0,0,0,0,0,0,0],
                    [0,0,0,0,0,0,0,0],
                    [0,0,0,0,0,0,0,0],
                    [0,0,0,0,0,0,0,0],
                    [0,0,0,0,0,0,0,0],
                    [0,0,0,0,0,0,0,0],
                    [0,0,0,0,0,0,0,0]]

matriu_resultant_fonetica =    [[0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0],
                                [0,0,0,0,0,0,0,0,0]]